text = "Статус вашего заказа"
print("________________________")
print("| " + text + " |")
print("________________________")

status = input('Введите статус заказа (pending/processing/shipped/delivered/cancelled): ').strip().lower()
match status:
    case "pending":
        text = '🕰️ В ожидании'
        desk = '🕰️ Заказ зарегистрирован и ожидает подтверждение оплаты'
        time = '🕰️ 1-2 дня '
    case "processing":
        text = '🕰️ В обработке'
        desk = 'Заказ собирается и ожидает отправление'
        time = '🕰️ 1-3 дня'
    case "shipped":
        text = '📦 Отправлено'
        desk = '📦 Вашь заказ находится в пути'
        time = '🕰️ 1-4 дня'
    case "delivered":
        text = '📦 Доставлено'
        desk = '😁 Заказ доставлен получателю'
        time = '👍 Заказ завершён'
    case "cancelled":
        text = '❌ Отменено'
        desk = '❌ Получатель отменил заказ'
        time = '❌ Заказ отменён'
    case _:
        text = '❌ Ощибка'
        desk = '❌ Ощибка'
        time = '❌ Ощибка'

print(f'Статус заказа {text}')
print(f'Описание заказа {desk}')
print(f'Время доставки {time}')


